{
  "raw_text": "Pushpendra Singh\n\n· 3rd\n\nCTO, Quabyt Tech\n\nHyderabad, Telangana, India\n\n·\n\nContact info\n\n\nQuabyt Tech\n\n\nMotilal Nehru National Institute Of Technology\n\n500+\n\nconnections\n\nConnect\n\nAbout\nLeading the design of scalable AI and cloud systems, and building high-performance tech teams.\n\nActivity\n1,210 followers\n\n\nFollow\n\nPosts\n\nComments\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n3w • Edited • \n\nWe're Hiring!\n\nHey everyone! We're on the lookout for a talented AWS Data Engineer to join our team. If you have strong experience building production data pipelines and data lakes on AWS, we want to hear from you!\n\nIn this role, you'll design, implement, and maintain ELT pipelines using AWS S3, Glue, and Athena to support analytics and GenAI use cases. We're looking for someone who can build reliable, scalable data solutions that power insights and ML applications.\n\nCheck out the full job description & apply here: https://lnkd.in/gWdYqVZa\n\nPlease note, this is not an entry-level position. Thanks for your help, and feel free to share this post!… more\n\nAWS Data Engineer - Careers at Quabyt\n\nquabyt.com\n\n21 reactions21\n\n9 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n2mo • Edited • \n\nA practical take on AI in software development from our team: https://lnkd.in/gfqF9ztP\n\n30 reactions30\n\n4 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\nGreg Leizerowicz  • 3rd+\n\nCo-Founder and Chief Technology Officer at HopSkip\n\n2mo • \n\nGreat partners are hard to find!\n\nThanks Suman C. and the team at Quabyt Tech for adapting and growing with us! Next lunch will have to be on the other side of the globe!… more\n\n\n141 reactions141\n\n1 comment\n\n•\n\n4 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n9mo • Edited • \n\nWe're Hiring!\n\nHey everyone! We’re on the lookout for a talented AI/GenAI Engineer to join our team. If you have a strong background in machine learning, cloud architecture, and software development, we want to hear from you! \n\nIn this role, you’ll design, develop, and deploy AI-driven applications using generative AI models on platforms like AWS and Azure. We’re looking for someone who can create scalable and innovative solutions tailored to our Clients' needs.\n\nCheck out the full job description here: https://lnkd.in/gKcqKwSR\n\nPlease note, this is not an entry-level position. \n\nIf you’re interested or know someone who might be a great fit, please send your resumes and referrals to: bec06858.quabyt.com@in.teams.ms\n\nThanks for your help, and feel free to share this post!… more\n\nCareers | Quabyt - AI Engineer\n\nquabyt.com\n\n42 reactions42\n\n3 comments\n\n•\n\n8 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n11mo • Edited • \n\nWe are thrilled to invite applications for a 3-month internship starting in January!\n\nThis opportunity is open to everyone, including final-year college students, regardless of backlogs, CGPA, or degree discipline. We welcome applicants from all engineering backgrounds.\n\nOur internships are designed to be intense and will equip you with the skills to deliver world-class consulting services to our clients.\n\nWe are also excited to share that we have made full-time offers to Shailesh, Swathi, and Rahul from our previous internship opportunities. We are proud to be their team of choice!\n\nIf you love solving problems with code, we would love to hear from you! Please send your internship applications to\n92105bee.quabyt.com@in.teams.ms\n8861fa10.quabyt.com@in.teams.ms\n\nFor experienced professionals, feel free to apply for open positions through our website.\n\nLooking forward to your applications!\n\nFollow Quabyt Tech LinkedIn page for updates.… more\n\n39 reactions39\n\n9 comments\n\n•\n\n6 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\nSuman C.  • 3rd+\n\nAI & Cloud Engineering\n\n1yr • Edited • \n\nQuabyt Tech is hiring! \n\nJob descriptions\n\n.NET Azure Developer\nhttps://lnkd.in/gMm-77BM\n\nFullstack Next.js, NestJS, AWS Developer\nhttps://lnkd.in/geu4ziuJ\n\nAutomation QA\nhttps://lnkd.in/gf9WV7CB\n\nFullstack .Net\nhttps://lnkd.in/gkKHZDGs\n\nPlease send your resumes to\nbec06858.quabyt.com@in.teams.ms\ncareers@quabyt.com… more\n\n76 reactions76\n\n2 comments\n\n•\n\n13 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\nSuman C.  • 3rd+\n\nAI & Cloud Engineering\n\n1yr • \n\nCheck out this job at Quabyt Tech: Full Stack .Net consultant\n\n\nFull Stack .Net consultant\n\nQuabyt Tech\n\nIndia (Remote)\n\nView job\n21 reactions21\n\n4 comments\n\n•\n\n3 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n1yr • \n\nWishing all friends of Quabyt a very happy new year and wishing it is filled with good health, growth, learning and wisdom! \nWe had a fun filled blessed year and thank all our clients, team members, partners, friends, family and well wishers for being there to cheer us as we invent the future with our clients!\n\n120th Anniversary of the First Powered, Controlled Flight\nOrville Wright makes the first powered, controlled flight on Earth as his brother Wilbur looks on in this image taken at Kitty Hawk, North Carolina, on Dec. 17, 1903. Orville Wright covered 120 feet in 12 seconds during the first flight. The Wright brothers made four flights that day, each longer than the last.\nImage Credit: Library of Congress\nhttps://lnkd.in/gD5wAZDb… more\n\n\n52 reactions52\n\n2 comments\n\n•\n\n3 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\nRod Rivera  • 3rd+\n\nLearn to Automate with AI\n\nView my newsletter\n\n1yr • \n\nPostgresML - AI library of the day: PostgresML is an open-source library available in Python, Javascript, and SQL, extending 🐘 PostgreSQL into a machine learning platform, allowing you to train models and make predictions using SQL right inside your database.\n\nPostgresML extends 🐘 PostgreSQL into a complete platform for classical machine learning and AI. It enables AI engineers to train and deploy models directly in their database using standard SQL queries. Its main benefit is eliminating the complex microservice infrastructure typically needed for model management.\n\n💡 PostgresML Key Highlights\n\n1️⃣ GPU-powered inference for low latency predictions and streaming response support from large language models like GPT-3\n\n2️⃣ Manage open source ML models from HuggingFace 🤗 and track experiment results\n\n3️⃣ Train tabular data on 50+ algorithms like random forests 🌳 and neural networks 🧠\n\n4️⃣ Generate and index vector embeddings for text search, recommendations, etc\n\n5️⃣ Horizontal scalability to millions of predictions per second utilizing PostgreSQL's reliability and tooling\n\nBy consolidating your model data pipeline into PostgreSQL, PostgresML streamlines MLOps. You can go from training to production deployment with simple SQL, keeping your models close to your data and application for faster insights. 🚀\n\nOverall, PostgresML simplifies machine learning infrastructure by leveraging PostgreSQL's mature data management capabilities. It's like bringing your models directly into your database.\n\n📊 Tell me more about PostgresML!\n* 👷🏽‍♀️ Builders: Lev Kokotov, Montana Low, Santi Adavani, Daniel Illenberger\n* 👩🏽‍💻 Contributors: 39 \n* 💫 GitHub Stars: 4.7k\n* 🍴 Forks: 205\n* 👁️ Watch: 48\n* 🪪 License: MIT\n* 🔗 Links: Below 👇🏽\n\n🧙🏽 Follow The AI Engineer for more about PostgresML and daily insights tailored to AI engineers. Subscribe to our newsletter. We are the AI community for hackers!\n\n♻️ Repost this to help PostgresML become more popular. Support AI Open-Source Libraries!\n\n⚠️ If you want me to highlight your favorite AI library, open-source or not, please share it in the comments section!\n… more\n\n\n913 reactions913\n\n18 comments\n\n•\n\n91 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\nPushpendra Singh reposted this\n\n\n\nQuabyt Tech\n\n577 followers\n\n1yr • \n\nWe are looking for candidate with strong hands on experience on the below skills: \n\n1) Machine Learning (Python)\n2) Deep Learning \n3) Computer Vision\n4) Natural Language Processing.\n5) ML model development and deployment in Azure\n\nIf interested please post your CVs at careers@quabyt.com. Please contact john@quabyt.com in case of any queries. Thank you.\n\n22 reactions22\n\n9 reposts\n\n\nLike\n\n\nComment\n\nRepost\n\nSend\n\nShow all\nExperience\nQuabyt Tech logo\nPartner, CTO\n\nQuabyt Tech · Full-time\n\nJul 2023 - Present · 2 yrs 5 mos\n\nHyderabad, Telangana, India · On-site\n\nNeudesic logo\nNeudesic\n\nFull-time · 15 yrs 4 mos\n\nDirector Of Technology\n\nJan 2020 - Jul 2023 · 3 yrs 7 mos\n\nPrincipal Consultant\n\nJan 2012 - Dec 2019 · 8 yrs\n\nArchitected large scale distributed systems in Hospitality, Oil & Gas & Insurance domains. Built org wide programs for upskilling, driving initiatives & enhancing delivery quality. Edited and published a company wide tech magazine. \n\nSkills: \nArchitecture & Design\nCloud Computing\nDesign Thinking\nEvent Storming\nDomain-Driven Design (DDD)\nAgile Methodologies\nScaled Agile Framework (SAFe)\nCloud-Native Development\nFull-Stack Development with multiple languages\nBlockchain Expertise… more\n\nSenior Consultant\n\nJan 2010 - Dec 2011 · 2 yrs\n\nConsultant\n\nJan 2009 - Dec 2009 · 1 yr\n\nAssociate Consultant\n\nApr 2008 - Dec 2008 · 9 mos\n\nWipro logo\nSoftware Engineer\n\nWipro · Full-time\n\nAug 2005 - Mar 2008 · 2 yrs 8 mos\n\nHyderabad, Telangana, India\n\nEducation\n\nMotilal Nehru National Institute Of Technology\n\nBachelor of Technology - BTech, Mechanical Engineering\n\n2001 – 2005\n\nSkills\nIT Strategy\n\n2 endorsements\n\nEndorsed by 1 person in the last 6 months\n\nTechnical Leadership\n\n2 endorsements\n\nEndorsed by 1 person in the last 6 months\n\n\nShow all\nOrganizations\nNeudesic\n\nApr 2008 – Present\n\nWipro\n\nSoftware Engineer · Aug 2005 – Mar 2008"
}